Koisuji02/ARM_LPC1768/ESAMI_SVOLTI/ESAME_12032024/TEMPLATE_ESAME/Source/RIT/IRQ_RIT.c
/*********************************************************************************************************
**--------------File Info---------------------------------------------------------------------------------
** File name:           IRQ_RIT.c
** Last modified Date:  2014-09-25
** Last Version:        V1.00
** Descriptions:        functions to manage T0 and T1 interrupts
** Correlated files:    RIT.h
**--------------------------------------------------------------------------------------------------------
*********************************************************************************************************/
#include "LPC17xx.h"
#include "RIT.h"
#include "timer/timer.h"

/******************************************************************************
** Function name:		RIT_IRQHandler
**
** Descriptions:		REPETITIVE INTERRUPT TIMER handler
**
** parameters:			None
** Returned value:		None
**
******************************************************************************/

unsigned char extractValue(int value);
unsigned char get_and_sort(unsigned char* vet, unsigned char val, int index);
int disabilitoKey1 = 0;

void RIT_IRQHandler(void) {
		//static int position = 0; // position da usare se joystick (1 = UP; 2 = RIGHT; 3 = LEFT; 4 = DOWN)
		static int debounce = 0;
	
		// GESTIONE BOTTONE KEY1
		if((LPC_PINCON->PINSEL4 & (1 << 22)) == 0){ // bottone premuto
				debounce++;
				// INT0 = 10; KEY1 = 11; KEY2 = 12
				if((LPC_GPIO2->FIOPIN & (1<<11)) == 0){   //bottone premuto ma in modalità interrupt con debounce attivo
					reset_RIT();
					switch(debounce){
						case 1: // dopo il time_interval con cui init_RIT (1 colpo, no debounce)
							// LETTURA VALORE TC
							disable_timer(1);
							value_tmp = LPC_TIM1->TC;
							enable_timer(1);
							val = extractValue(value_tmp);
						  vet[index] = val;
							index++;
							LED_Out(index);
							val = get_and_sort(vet, val, index);
							if(index == N){
								enable_timer(2);
								index = 0;
								NVIC_DisableIRQ(EINT1_IRQn);		/* disable Button interrupts			 */
								LPC_PINCON->PINSEL4    &= ~(1 << 22);     /* GPIO pin selection */
								disabilitoKey1 = 1;
							}
							break;
						default:
							// se non devo fare niente apparte debouncing, non scrivo niente
							break;
					}
				}	else{
					debounce = 0;
					disable_RIT(); // de commento solo senza joystick
					reset_RIT();
					// INT0 = 20; KEY1 = 22; KEY2 = 24
					if(disabilitoKey1 == 0){
						NVIC_EnableIRQ(EINT1_IRQn); // cambia pulsante_IRQn se altri pulsanti
						LPC_PINCON->PINSEL4 |= (1<<22);
					}
				}
			}
		

		// GESTIONE JOYSTICK (25 sarebbe il tasto premuto del joystick L3, R3)
	
		if ((LPC_GPIO1->FIOPIN & (1 << 29)) == 0) { // JOYSTICK UP
				//
		} else if ((LPC_GPIO1->FIOPIN & (1 << 28)) == 0) { // JOYSTICK RIGHT
				//
		} else if ((LPC_GPIO1->FIOPIN & (1 << 27)) == 0) { // JOYSTICK LEFT
				//
		} else if ((LPC_GPIO1->FIOPIN & (1 << 26)) == 0) { // JOYSTICK DOWN
				//
		}

//		switch (position) {
//				case 1:
//						// UP
//						break;

//				case 2:
//						// RIGHT
//						break;

//				case 3:
//						// LEFT
//						break;

//				case 4:
//						// DOWN
//						break;

//				default:
//						break;
//		}

	LPC_RIT->RICTRL |= 0x1; // Clear interrupt flag (non mi serve qua, altrimenti fa solo 1 mossa)
	return;
}

/******************************************************************************
**                            End Of File
******************************************************************************/
